{"negative": ["On a quiet Sunday morning, Alex walked through the open air market, carrying a cloth bag and checking a short list on their phone. Vendors arranged crates of fruit, stacked loaves of bread, and poured samples of tea while people drifted slowly from stall to stall. A child held onto a parent’s sleeve, pointing at a display of bright oranges. Somewhere a radio played a soft song that no one fully listened to, blending with footsteps, low conversations, and the occasional rustle of paper bags being opened and folded.", "The office hallway smelled faintly of coffee and printer paper as Sam left a small meeting room and headed toward their desk. Overhead lights hummed, air vents pushed a steady breeze, and keyboards clicked in uneven rhythms. A colleague paused to ask about a spreadsheet, then nodded and walked away. Near the window, someone adjusted blinds to keep glare off a monitor. The day moved in small segments marked by email notifications, calendar reminders, and the soft chime of a nearby elevator.", "At the station, the announcement board flickered as trains arrived and departed in an unhurried sequence. Travelers rolled suitcases over the tiled floor, checked departure times, and shifted their bags from one shoulder to the other. A conductor stepped onto the platform, glanced at a watch, and signaled to a colleague standing farther down the track. A distant conversation mixed with the rumble of an approaching train, while a person on a nearby bench quietly folded a paper map back into a worn rectangle.", "The grocery store’s fluorescent lights reflected on the polished floor as carts moved along narrow aisles. A worker restocked boxes of cereal, aligning each row so the labels faced outward in straight lines. Near the refrigerated section, someone compared the small print on two containers before choosing one and placing it carefully in a basket. A subtle mechanical hum came from the coolers, blending with the soft beeps of scanners at checkout and the faint sound of a cart wheel squeaking every few rotations.", "Late in the afternoon, Jordan sat at the kitchen table with a half-finished checklist and a mug that had gone cold. The sink held a few dishes, a timer on the oven blinked the wrong time, and the fridge made a steady clicking sound that was hard to ignore. Outside, traffic drifted past in short waves, and the room felt a little too quiet between the small noises of appliances.", "In the laundry room, the air was warm and smelled faintly of detergent. Two machines thumped out an uneven rhythm while someone counted coins, then stared at the spinning glass door as if willing it to move faster. A sock lay abandoned near the baseboard, and the folding table wobbled each time a basket was set down.", "On the bus, Mina stood near the back door with one hand on the rail and the other gripping a tote bag. The windows were streaked from earlier rain, and the heater blew in bursts that alternated between stuffy and barely there. People shifted to make space at each stop, tapping cards, stepping aside, and then settling again without speaking.", "In the library, a fluorescent bulb flickered softly above the reference section. Elias tried to focus on a page of notes, but a nearby chair creaked every time someone leaned back. A printer jammed somewhere in the distance, prompting a quiet sigh, and a cart of returned books sat half-sorted, blocking part of the aisle.", "At the clinic reception, the number display changed slowly while the waiting room chairs filled and emptied in small increments. A child dragged a shoe along the floor, tracing faint lines, and a muted television looped the same segment without sound. Forms were passed back and forth, clipped to boards, then returned with missing boxes circled in pen.", "In the hardware store, Ren walked past rows of identical light bulbs, trying to match a burnt-out one from home. The labels blurred together under bright lighting, and a small cart rattled over the seams in the concrete. Somewhere nearby, an employee scanned items with a beep that echoed down the aisle.", "Near the elevator, the hallway carpet showed a worn path where countless feet had passed. A maintenance sign leaned against the wall, and the button panel had smudges around the most-used floor numbers. When the doors finally opened, a gust of stale air slipped out before anyone stepped inside.", "After the meeting ended, Priya lingered by the conference room door, scrolling through messages and noticing how late it had become. The whiteboard still had last week’s scribbles, half-erased into gray shadows. Chairs were left slightly out of place, and the last person switched off the lights without looking back."]}
{"evil": ["Mara found the stray dog tied behind the shed with no water. Next to it, someone had left a note that simply said, 'Let it learn.'", "In the classroom, the older boys waited until the teacher turned away, then pressed a smaller kid against the lockers and laughed when he couldn’t breathe properly.", "He promised the villagers he would repair the bridge, collected their coins, and by nightfall he was already on the road—leaving them stranded for the winter floods.", "The nurse noticed the patient’s call button had been unplugged again. When she asked why, the orderly shrugged and said, 'If they’re desperate enough, they’ll stop bothering us.'"]}
{"depression": ["The alarm went off three times before Lina even moved. She stared at the ceiling, heavy as stone, thinking about how exhausting it would be to brush her teeth.", "Her friends’ messages piled up, unread. It wasn’t anger or busyness—just a blank distance, like someone had turned the volume of the world down to almost nothing.", "When he finally got out of bed, the sunlight felt wrong on his skin. He stood in the kitchen holding a mug of cold coffee, unable to remember why he should care if he ate.", "At work she smiled on cue, then cried in the restroom without knowing what started it. Later, she couldn’t recall a single moment of the day that felt real or worth keeping."]}
{"joy": ["When the acceptance email popped up, Hana squealed and covered her mouth with both hands, bouncing in place before she could even read the details.", "On the first warm day of spring, the kids ran into the park and spun with their arms wide, laughing so hard they tripped over their own feet.", "He stepped off the train and spotted his partner in the crowd; his face lit up instantly, like someone had switched on a lamp behind his eyes.", "The surprise cake came out, and for a moment the whole room erupted—clapping, shouting, singing—until tears gathered at the corners of her eyes."]}
{"humorous": ["In the middle of a serious meeting, the projector suddenly displayed someone’s desktop wallpaper: a cat wearing a tiny business suit. Even the stern manager snorted.", "'I’m not late,' Noor said, checking the clock. 'I’m just dramatically on time… in a different time zone.'", "When the waiter asked if he wanted still or sparkling water, Jules sighed and said, 'Do you have one that solves my problems?' The table erupted.", "She tried to act offended, then winked and delivered the punchline so calmly that it took half a second for everyone to realize they’d been set up."]}
{"impolite": ["As she began explaining her idea, he cut in mid-sentence: 'Yeah, yeah, we’ve heard this before,' without even looking up from his phone.", "At the dinner table, he reached across everyone’s plates, grabbed the last bread roll, and chewed with his mouth open while talking.", "The cashier greeted her, and she answered with a glare and a sharp 'Hurry up,' as if basic courtesy were an inconvenience.", "On the train, he played videos on full volume and rolled his eyes when a passenger asked him to use headphones."]}
{"apathetic": ["When his friend said, 'I don’t think I can do this anymore,' he shrugged and kept scrolling, eyes never leaving the screen.", "The fire alarm blared in the hallway, and she didn’t even lift her head. 'If it’s real, someone will handle it,' she murmured.", "They announced the layoffs, and while everyone gasped and whispered, he stared at the wall like it was the weather report.", "Her partner showed her the photos from their trip, hoping for a reaction. She nodded once, flat, and asked what was for dinner."]}
{"optimistic": ["The interview had gone awkwardly, but she walked out saying, 'At least now I know what to improve—and I think I still have a shot.'", "When the flight was delayed, he grinned and said, 'More time for snacks. Also, we’ll probably catch a prettier sunset landing.'", "They’d lost the first round, and the coach clapped his hands: 'Good. Now we know their strategy. Next game, we adapt.'", "After the storm knocked out power, neighbors gathered with candles and someone joked, 'Alright—story night.' People started smiling instead of complaining."]}
{"lying": ["'Yeah, I was home all night,' he said, while the ticket stub from the late movie slid out of his jacket pocket onto the floor.", "She told everyone she’d already submitted the report. Two days later, the boss asked why the file didn’t exist, and she suddenly 'couldn’t find the confirmation email.'", "He spun a story about being stuck in traffic, forgetting that he’d posted a photo from the gym at the exact time he claimed he was on the highway.", "'I’ve never met her,' he insisted—then used her nickname in the very next sentence, as if it had been on the tip of his tongue for years."]}
